package com.example.mytrainingsession

class ExerciseDataBase {

    companion object {
        val exercise = mutableListOf(
            Exercise(
                "Отжимание от пола",
                "Поставте руки на пол на ширине плеч, опускайте туловище, пока " +
                "грудь не коснётся пола. Разгибайте руки полностью, поднимая туловище.",
                30,
                R.drawable.pushup
            ),
            Exercise(
                "Приседание",
                "Встаньте, ноги на ширине плеч. " +
                        "Опустите туловище как можно ниже, сгибая ноги в коленях." +
                        " Вернитесь в исходное положение",
                45,
                R.drawable.squats
            ),
            Exercise(
                "Планка",
                "Примите упор лёжа, затем согните руки в локтях и " +
                        "перенесите вес тела на предплечья. " +
                        "Удерживайте это положениие отведенное время. ",
                60,
                R.drawable.plank
            ),
            Exercise(
                "Бег на месте",
                "Бегите на месте, высоко поднимая колени.",
                30,
                R.drawable.running
            ),
            Exercise(
                "Скручивания на пресс",
                "Лягте на спину, ноги согнуты в коленях. " +
                        "Поднимайте туловище, напрягая мышцы пресса, затем вернитесь в исходное положение.",
                40,
                R.drawable.crunches
            ),
            Exercise(
                "Прыжки на месте",
                "Прыгайте на месте, максимально высоко поднимая ноги.",
                30,
                R.drawable.jumping
            ),
            Exercise(
                "Махи ногами",
                "Стоя на одной ноге, выполняйте махи другой ногой.",
                30,
                R.drawable.leg_swings
            ),
            Exercise(
                "Бёрпи",
                "Встаньте, затем опуститесь в упор лёжа, выполните отжимание, вернитесь в исходное положение и выполните прыжок вверх.",
                45,
                R.drawable.burpee
            ),
            Exercise(
                "Выпады",
                "Встаньте прямо, сделайте шаг вперёд одной ногой, опускаясь в выпад. Вернитесь в исходное положение и повторите с другой ногой.",
                40,
                R.drawable.lunges
            ),
            Exercise(
                "Подъёмы на носки",
                "Встаньте прямо, поднимитесь на носки как можно выше, затем вернитесь в исходное положение.",
                30,
                R.drawable.calf_raises
            ),
            Exercise(
                "Альпинист с шагом",
                "Работа ведется в планке на руках. Ваша задача — совершать поочередные прыжковые шаги в выпаде. "+
                "Правая стопа встает к правой ладони, затем резким выпрыгиванием поменяйте стороны так, чтобы уже левая стопа встала к левой ладони. ",
                30,
                R.drawable.climber
            )
        )
    }
}